Documents/ЗаписьКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ЗаписьКлиента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыКлиентов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УслугаОказана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаписьКлиента/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный)Тогда
    	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	УстановитьДоступностьЭлементовФормы(); 
	
	Если Объект.Ссылка.Пустая() Тогда
		Если Параметры.Свойство("Начало") Тогда
			Объект.ДатаЗаписи = Параметры.Начало;
		КонецЕсли;
		Если Параметры.Свойство("Окончание") Тогда
			Объект.ДатаОкончанияЗаписи = Параметры.Окончание;
		КонецЕсли; 
		Если Параметры.Свойство("Сотрудник") Тогда
			Объект.Сотрудник = Параметры.Сотрудник;
		КонецЕсли;
	КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	Если ЗначениеЗаполнено (СтрокаТЧ.Услуга) Тогда
		СтрокаТЧ.Стоимость = РаботаСЦенами.ПолучитьЦенуПродажи(СтрокаТЧ.Услуга,,Объект.Дата); 
	Иначе
		СтрокаТЧ.Стоимость = 0;
	КонецЕсли;
	ДлительностьУслуги = РассчитатьДатуОкончанияЗаписи(); 
	Если ДлительностьУслуги = 0 Тогда
		ДлительностьУслуги = 60;
	КонецЕсли; 
	ОкончаниеЗаписи = Объект.ДатаЗаписи + ДлительностьУслуги*60;
	ОкончаниеРабочегоДня = ПолучитьОкончаниеРабочегоДня();
	Если ВремяДляСравнения(ОкончаниеЗаписи)> ВремяДляСравнения(ОкончаниеРабочегоДня) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "В указанное время невозможно оказать услугу.Выберите другое время для записи!";
		Сообщение.Сообщить(); 
		Элементы.ФормаКоманднаяПанель.Доступность = Ложь;
	Иначе
		Объект.ДатаОкончанияЗаписи = ОкончаниеЗаписи;
		Элементы.ФормаКоманднаяПанель.Доступность = Истина;
	КонецЕсли;
	КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	Если ЗначениеЗаполнено (СтрокаТЧ.Услуга) Тогда
		СтрокаТЧ.Стоимость = РаботаСЦенами.ПолучитьЦенуПродажи(СтрокаТЧ.Услуга,,Объект.Дата); 
	Иначе
		СтрокаТЧ.Стоимость = 0;
	КонецЕсли; 
	КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	Если НЕ РольДоступна("ПолныеПрава") Тогда	
		Элементы.УслугаОказана.ТолькоПросмотр = Истина;	
	КонецЕсли;                                         
КонецПроцедуры   

&НаСервере
Функция РассчитатьДатуОкончанияЗаписи() 
	ТЧУслуги = Объект.Услуги.Выгрузить(,"Услуга");
	Если ТЧУслуги.Количество() Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТЧУслуги",ТЧУслуги);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТЧУслуги.Услуга КАК Услуга
		               |ПОМЕСТИТЬ ВТ_Номенклатура
		               |ИЗ
		               |	&ТЧУслуги КАК ТЧУслуги
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СУММА(НоменклатураСПР.ДлительностьУслуги) КАК ДлительностьУслуг
		               |ИЗ
		               |	ВТ_Номенклатура КАК ВТ_Номенклатура
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСПР
		               |		ПО ВТ_Номенклатура.Услуга = НоменклатураСПР.Ссылка"; 
		Результат = Запрос.Выполнить();
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		возврат Выборка.ДлительностьУслуг; 
	Иначе 
		возврат 0;   	
    КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ДатаЗаписиПриИзменении(Элемент)
	ДлительностьУслуги = РассчитатьДатуОкончанияЗаписи(); 
	Если ДлительностьУслуги = 0 Тогда
		ДлительностьУслуги = 60;
	КонецЕсли;
	ОкончаниеЗаписи = Объект.ДатаЗаписи + ДлительностьУслуги*60;
	ОкончаниеРабочегоДня = ПолучитьОкончаниеРабочегоДня();
	НачалоРабочегоДня = ПолучитьНачалоРабочегоДня();
	Если ВремяДляСравнения(ОкончаниеЗаписи)> ВремяДляСравнения(ОкончаниеРабочегоДня) ИЛИ ВремяДляСравнения(Объект.ДатаЗаписи) < ВремяДляСравнения(НачалоРабочегоДня) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "В указанное время невозможно оказать услугу.Выберите другое время для записи!";
		Сообщение.Сообщить(); 
		Элементы.ФормаКоманднаяПанель.Доступность = Ложь; 
		Элементы.УслугиКоманднаяПанель.Доступность = Ложь;
	Иначе
		Объект.ДатаОкончанияЗаписи = ОкончаниеЗаписи;
		Элементы.ФормаКоманднаяПанель.Доступность = Истина;
		Элементы.УслугиКоманднаяПанель.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Записан заказ!");
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	ДлительностьУслуги = РассчитатьДатуОкончанияЗаписи(); 
	Если ДлительностьУслуги = NULL Тогда
		ДлительностьУслуги = 60;
	КонецЕсли; 
	ОкончаниеЗаписи = Объект.ДатаЗаписи + ДлительностьУслуги*60;
	ОкончаниеРабочегоДня = ПолучитьОкончаниеРабочегоДня(); 
	Если ВремяДляСравнения(ОкончаниеЗаписи)> ВремяДляСравнения(ОкончаниеРабочегоДня) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "В указанное время невозможно оказать услугу.Выберите другое время для записи!";
		Сообщение.Сообщить(); 
		Элементы.ФормаКоманднаяПанель.Доступность = Ложь;
	Иначе
		Объект.ДатаОкончанияЗаписи = ОкончаниеЗаписи;
		Элементы.ФормаКоманднаяПанель.Доступность = Истина;
	КонецЕсли;
     
КонецПроцедуры

&НаСервере
Функция ПолучитьОкончаниеРабочегоДня()
	 ОкончаниеРабочегоДня = Константы.ОкончаниеРабочегоДня.Получить();
	 Возврат ОкончаниеРабочегоДня;
 КонецФункции
 
&НаСервере
 Функция ПолучитьНачалоРабочегоДня()
	 НачалоРабочегоДня = Константы.НачалоРабочегоДня.Получить();
	 Возврат НачалоРабочегоДня;
 КонецФункции
	 
&НаКлиенте
Функция ВремяДляСравнения(Время)
	ВремяЧисло = Час(Время)*3600 + Минута(Время)*60 + Секунда(Время); 
	Возврат  ВремяЧисло;
КонецФункции
